package q.rorbin.badgeview.demo;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by chqiu on 2017/2/13.
 */

public class DataSupport {
    private List<String> mDatas;

    public DataSupport() {
        mDatas = new ArrayList<>();
        mDatas.add("(`･ω･´)ฅ铲屎官快来");
        mDatas.add("�?(´-ω-`)ฅ好酥胡");
        mDatas.add("~(=^･ω･^)ฅ☆ 澡桑嚎啊小婊�?");
        mDatas.add("(=ฅರ﹏ರ)ฅ我要小鱼干");
        mDatas.add("(ฅ�?�皿�?)ฅ︵┻┻ 为什么不跟我玩儿");
        mDatas.add("�?(ฅ≧へ≦)ฅ饭不好�?");
        mDatas.add("(╬￣皿￣)ฅ拒绝洗�?");
        mDatas.add("�?(=�?.￣||)ฅ愚蠢的人类");
        mDatas.add("�?*:.�?. �?(≧▽�?)�? .�?.:*☆�?");
        mDatas.add("�?((๑˘ㅂ˘�?)ฅ^._.^ฅ我萌吗");
        mDatas.add("༻ི(ؔᵒ̶̷ᵕؔᵒ̷�?)༄୭*ˈ 浪到飞起");
        mDatas.add("*:ஐ�?(๑´ᵕ`)۶�?:* 透心凉心飞扬");
        mDatas.add("˚�?*୧⃛(๑⃙⃘⁼̴̀꒳⁼̴́๑⃙�?)୨⃛*₊˚⋆ 精神百�??");
        mDatas.add("٩(ꇐ�?�ꇐ)۶世界那么大我想去看看");
        mDatas.add("๛꜀꒰ ˟⌂˟�? ꜆꒱꜆ 起来，不愿做作业的人们");
        mDatas.add("˚‧�?(´ฅ･ｪ･ฅ�??)‧�?.喵，救命啊，人家怕水");
        mDatas.add("(�?,,Ծｪ�?,,�?)这款裙子是为本宝宝定制的�?");
        mDatas.add("�?(ಠｪ�?)و美图软件用的好，老公才好�?");
        mDatas.add("(҂`･ｪ･�?) <,︻╦̵̵̿╤─ ҉ - -- 让你�?恩爱�?");
        mDatas.add("为你加油！！！！！！\n" +
                "�?�?  *�?.  �?☆\n" +
                "�?�?. ∧＿∧�??∩�??* ☆\n" +
                "*  �? ( ・∀�?)/ .\n" +
                "�?.  ⊂�??�? �?* ☆\n" +
                "�? * (�? �?  .☆\n" +
                "�?�? (�?");
        mDatas.add("老\n" +
                "�?板\n" +
                "�?�?说\n" +
                "�?�?�?今\n" +
                "�?�?�?�?天\n" +
                "�?�?�?�?�?放\n" +
                "�?�?�?�?�? 假\n" +
                "�?�?�?     ！\n" +
                "�?ヽ＼�? /／\n" +
                "�? �? ∧∧�?｡\n" +
                "�? �? (ﾟ∀�?)�? ﾟ\n" +
                "�?�?�?(っﾉ\n" +
                "�? �?�?`�?");
        mDatas.add("巴拉巴拉巴拉，把你变成猪！\n" +
                "�? ∧＿∧\n" +
                " （｡･ω･�?)つ━☆・*。\n" +
                "  ⊂�??�? �? �?�?�?・゜+.\n" +
                "�?しーＪ�??�?�?°�?+ *´¨)\n" +
                "�?�?�?       �?�?.· ´¸.·*´¨) ¸.·*¨)\n" +
                "�?�?�?�?�?�?�?     �?(¸.·´ (¸.·�?*");
    }

    public List<String> getData() {
        return mDatas;
    }
}
